---
kind: property
id: P:Autodesk.Revit.DB.CurveUV.IsBound
source: html/a04a73a2-cfec-100d-6600-b715036e285e.htm
---
# Autodesk.Revit.DB.CurveUV.IsBound Property

Describes whether the parameter of the curve is restricted to a particular interval.

## Syntax (C#)
```csharp
public bool IsBound { get; }
```